<a href="https://colab.research.google.com/github/LIMSONA/Machine_learning_study/blob/main/DataFrame_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 들어가기

In [ ]:
import os
import pandas as pd
# python 빌트인 os 라이브러리 import 및 파일 위치 확인
# 1주차 실습을 위한 pandas 라이브러리 import 및 pd로 alias 지정

In [ ]:
os.listdir('./drive/MyDrive/파이썬~머신러닝/machine_learning_data')

['friend.csv', 'new_friend.csv']

In [ ]:
base_src = './drive/MyDrive/파이썬~머신러닝/machine_learning_data'
# 데이터 폴더 src 변수 할당

In [ ]:
friend_src=base_src+"/friend.csv"
# friend.csv 파일 src 변수 할당

In [ ]:
friend_src

'./drive/MyDrive/파이썬~머신러닝/machine_learning_data/friend.csv'

In [ ]:
df=pd.read_csv(friend_src,encoding='utf-8')
# pandas의 read_csv => 데이터 불러오기
## encoding= 데이터 인코딩 방식 설정

In [ ]:
df.head()
#파일읽기

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [ ]:
df.head(6)
#상위 6개 파일읽기

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [ ]:
new_friend_src=base_src + "/new_friend.csv"

In [ ]:
new_friend_src

'./drive/MyDrive/파이썬~머신러닝/machine_learning_data/new_friend.csv'

In [ ]:
df.to_csv(new_friend_src,index=False,encoding='utf-8')
# pandas의 to_csv => 데이터 프레임 저장
## index = True or False =>데이터 저장시 새로운 인덱스를 생성할지 말지
## encoding => 데이터 인코딩 방식 설정

In [ ]:
os.listdir(base_src)

['friend.csv', 'new_friend.csv']

In [ ]:
pd.Series([1,2,3])

0    1
1    2
2    3
dtype: int64

In [ ]:
pd.Series([1,2,3], index=['가','나','다'])

가    1
나    2
다    3
dtype: int64

In [ ]:
#index는 
# 1)조회를 하기위해 만든다.
# 2) 죄회를 하기위해 만든다.

# **Series 실습**

In [ ]:
#series 실습
import numpy as np
np.array([1,2,3])

array([1, 2, 3])

In [ ]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [ ]:
#데이터프레임(집합) -> 시리즈(단일) ->시리즈가 데이터프레임이 될수 있겠구나
series = df['name']
series

0     John
1    Jenny
2     Nate
3    Julia
4    Brian
5    Chris
Name: name, dtype: object

In [ ]:
#pd.Series 함수를 통해서 만드는 것도 가능
Series=pd.Series([1,2,3,4])
Series

0    1
1    2
2    3
3    4
dtype: int64

In [ ]:
# pd.Series의 옵션으로 무엇이 있는 지 확인
# indexindex => 할당값의 지정 이름, 중복 가능['a','a','b','c']
# dtype => 대표적: int, float, string, boolean 등

In [ ]:
series = pd.Series([1,2,3,4],index=['a','b','c','d'],dtype=float)
series

a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64

In [ ]:
series = pd.Series([10,2,5,4],index=['a','b','c','d'],dtype=float)

a    10.0
b     2.0
c     5.0
d     4.0
dtype: float64

In [ ]:
series = pd.Series([10,2,5,4],index=['a','b','c','d'],dtype=float)
series.sort_values(ascending=True) # 오름차순/ False는 내림차순

b     2.0
d     4.0
c     5.0
a    10.0
dtype: float64

In [ ]:
series #변수지정을 하지 않아서 다시 원래대로 된것임

a    10.0
b     2.0
c     5.0
d     4.0
dtype: float64

In [76]:
## sort_index => index값 정렬
series = pd.Series([10,2,5,4],index=['z','f','c','d'],dtype=float)
series.sort_index()

c     5.0
d     4.0
f     2.0
z    10.0
dtype: float64

# **DataFrame 실습**

In [80]:
#딕셔너리 형태로 넣음
df= pd.DataFrame({'a':[2,3],'b':[5,10]},columns=['b','a'])
df

    b  a
0   5  2
1  10  3

In [ ]:
df=pd.DataFrame() #빈데이터 프레임 만들고
raw data-> 가공처리하기위해(for반복문돌리고)-> df=pd.concat([df,df_new,axis=0])

In [84]:
# 2차원 리스트 형태로 넣음 열로 들어감
df=pd.DataFrame([[2,5],[3,10],[10,20]],columns=['a','b'])
df

    a   b
0   2   5
1   3  10
2  10  20

In [87]:
df=pd.DataFrame([[2,5,100],[3,10,200],[10,20,300]],
                columns=['a','b','c'], index=['가','나','다'],dtype=float)
df

      a     b      c
가   2.0   5.0  100.0
나   3.0  10.0  200.0
다  10.0  20.0  300.0

# **DataFrame 행,열 선택 및 필터링**

In [88]:
df = pd.read_csv(friend_src,encoding='utf-8')
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [90]:
# index 2번에 해당하는 row(행) 가져오기
df.iloc[2] #series 형태로 가져옴

name       Nate
age          30
job     teacher
Name: 2, dtype: object

In [93]:
df.iloc[[4]] # DataFrame 형태로 가져옴
# select * from friend where pk=4

    name  age      job
4  Brian   45  manager

In [94]:
df['job'] #column 값 보기

0      student
1    developer
2      teacher
3      dentist
4      manager
5       intern
Name: job, dtype: object



*   비교 1
 - loc는 써져있는 인덱스 그대로
 - iloc는 실제 인덱스 형태로(숫자)

In [96]:
df.loc[:,'job'] #loc는 column에 써져있는 '형태 그대로' 조회하여 가져오기

0      student
1    developer
2      teacher
3      dentist
4      manager
5       intern
Name: job, dtype: object

In [98]:
df.iloc[:,2] #iloc는 column을 '숫자'형태로 조회하여 가져오기

0      student
1    developer
2      teacher
3      dentist
4      manager
5       intern
Name: job, dtype: object



*   비교2

In [104]:
df.loc[1,'job'] #인덱스 1에서 job

'developer'

In [102]:
df.iloc[1,2] # 인덱스 1에서 2번쨰 column 
#iloc와 loc 차이중요!

'developer'

In [108]:
#슬라이싱할때 [원하는 row,원하는 column] 형식으로 씀
df.iloc[0:2,1:3]

   age        job
0   20    student
1   30  developer

In [109]:
df.iloc[0:2,[1,2]]

   age        job
0   20    student
1   30  developer

* 비교3

In [110]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [113]:
#인덱스 바꾸기
df.index=[1,2,3,4,5,6]
df

    name  age        job
1   John   20    student
2  Jenny   30  developer
3   Nate   30    teacher
4  Julia   40    dentist
5  Brian   45    manager
6  Chris   25     intern

In [114]:
df.loc[2,:] #loc는 인덱스에 써져있는 것으로 찾음

name        Jenny
age            30
job     developer
Name: 2, dtype: object

In [116]:
df.iloc[2,:] #iloc는 실제 인덱스번호 것으로 찾음

name       Nate
age          30
job     teacher
Name: 3, dtype: object

# **DataFrame 행,열 삭제**

In [ ]:
#머신러닝....... 가지치기.... 대체값처리 중요함(데이터가 비어있는 경우)

In [118]:
import numpy as np

In [122]:
df=pd.DataFrame(np.arange(12).reshape(3,4),
                columns=['A','B','C','D'])
df

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [124]:
np.arange(12).reshape(3,4) #reshape(행,열)

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [ ]:
## ['B','C'] 컬럼을 삭제하겠다. 
#axis=0 or 1 => axis=0:row 방향 , axis=1:col 방향
df.drop(['B', 'C'], axis=1)

In [125]:
df #할당을 안해주었기에 다시 원래대로 옴

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [126]:
# 만약 변수할당이 귀찮다면 parameter로 inplace=True를 주어라.
df.drop(['B', 'C'], axis=1,inplace=True)
df

   A   D
0  0   3
1  4   7
2  8  11

In [133]:
df=pd.DataFrame(np.arange(12).reshape(3,4),
                columns=['A','B','C','D'])
df

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [137]:
df.drop([0, 1],axis=0)

   A  B   C   D
2  8  9  10  11

In [138]:
df.drop([0,1]) #axis=0은 생략가능하다

   A  B   C   D
2  8  9  10  11

# DataFrame 행,열 수정

In [140]:
df.loc[1,'C']='육' #6을 육으로 바꾸기
df

   A  B   C   D
0  0  1   2   3
1  4  5   육   7
2  8  9  10  11

In [142]:
df.iloc[1,2] =6 #육을 6으로 바꾸기
df

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [144]:
# df를 하나 복사하기(원본 데이터 유지를 위해서)
temp = df.copy()
temp

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [146]:
temp.iloc[:,1] ='끝'
temp

   A  B   C   D
0  0  끝   2   3
1  4  끝   6   7
2  8  끝  10  11

In [150]:
temp.iloc[:,:]='정말끝!'
temp

      A     B     C     D
0  정말끝!  정말끝!  정말끝!  정말끝!
1  정말끝!  정말끝!  정말끝!  정말끝!
2  정말끝!  정말끝!  정말끝!  정말끝!